package com.study.yang.dynamicshortcutsdemo.data;

/**
 * Created by Administrator on 2018/2/7.
 */

/**
 * Demo所用的数据项
 */
public class DataResource {

    //试用与刷新列表的数据
    public static String[] stringsZero = {
            "天地有正气，杂然赋流形。00",
            "下则为河岳，上则为日星。01",
            "於人曰浩然，沛乎塞苍冥。02",
            "皇路当清夷，含和吐明庭。03",
            "时穷节乃见，一一垂丹青。04",
            "在齐太史简，在晋董狐笔。05",
            "在秦张良椎，在汉苏武节。06",
            "为严将军头，为嵇侍中血。07",
            "为张睢阳齿，为颜常山舌。08",
            "或为辽东帽，清操厉冰雪。09",
            "或为出师表，鬼神泣壮烈。10",
            "或为渡江楫，慷慨吞胡羯。11"
    };

    public static String[] stringsFirst = {
            "或为击贼笏，逆竖头破裂。12",
            "是气所磅礴，凛烈万古存。13",
            "当其贯日月，生死安足论。14",
            "地维赖以立，天柱赖以尊。15",
            "三纲实系命，道义为之根。16",
            "嗟予遘阳九，隶也实不力。17",
            "楚囚缨其冠，传车送穷北。18",
            "鼎镬甘如饴，求之不可得。19",
            "阴房阗鬼火，春院闭天黑。20",
            "牛骥同一皂，鸡栖凤凰食。21",
            "一朝蒙雾露，分作沟中瘠。22",
            "如此再寒暑，百疠自辟易。23"
    };

    public static String[] stringsSecond = {
            "哀哉沮洳场，为我安乐国。24",
            "岂有他缪巧，阴阳不能贼。25",
            "顾此耿耿存，仰视浮云白。26",
            "悠悠我心悲，苍天曷有极。27",
            "哲人日已远，典刑在夙昔。28",
            "风檐展书读，古道照颜色。29",
    };

    //试用与联系人列表的数据
    public static String[] contacts = {
            "宋江", "卢俊义", "吴用", "公孙胜", "关胜", "林冲", "秦明", "呼延灼", "花荣", "柴进", "李应",
            "朱仝", "鲁智深", "武松", "董平", "张清", "杨志", "徐宁", "索超", "刘唐", "李逵", "史进",
            "穆弘", "雷横", "李俊", "阮小二", "张横", "阮小五", "张顺", "阮小七", "杨雄", "石秀", "解珍",
            "解宝", "燕青", "朱武", "黄信", "孙立", "宣赞", "郝思文", "韩滔", "彭玘", "单廷圭", "魏定国",
            "萧让", "裴宣", "欧鹏", "邓飞", "燕顺", "杨林", "凌振", "蒋敬", "吕方", "郭盛", "安道全",
            "皇甫端", "王英", "扈三娘", "邓飞", "鲍旭", "樊瑞", "孔明", "孔亮", "项充", "李衮", "金大坚",
            "马麟", "童威", "童猛", "孟康", "侯健", "陈达", "杨春", "郑天寿", "陶宗旺", "宋清", "乐和",
            "龚旺", "丁得孙", "穆春", "曹正", "宋万", "杜迁", "薛永", "李忠", "周通", "汤隆", "杜兴",
            "邹渊", "邹润", "朱贵", "朱富", "施恩", "蔡福", "蔡庆", "李立", "李云", "焦挺", "石勇",
            "孙新", "顾大嫂", "张青", "孙二娘", "王定六", "郁保四", "白胜", "时迁", "段景住"
    };
}
